app/controllers/admin/blogs_controller.rb

  def index
    @tags = Blog.tag_counts_on(:tags)
    if params[:tag]
      @tag = params[:tag]
      @blogs = Blog.tagged_with(params[:tag])
    elsif params[:search_word]
      @search_word = params[:search_word]
      @blogs = Blog.where("title Like ?", "%" + @search_word + "%")
    else
      @blogs = Blog.all
---
SELECT "blogs".* FROM "blogs"

  def create
    @blog = Blog.new(blog_params)
    if @blog.save
---
INSERT INTO "blogs" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", ""], ["body", ""], ["created_at", "2021-09-11 15:39:45.999898"], ["updated_at", "2021-09-11 15:39:45.999898"]]

  def update
    @blog = Blog.find(params[:id])
    if @blog.update(blog_params)
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "blogs" SET "body" = ?, "top_image_id" = ?, "body_image_id" = ?, "updated_at" = ? WHERE "blogs"."id" = ?